namespace Pract_09_01
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Создайте dll-модуль, который содержит класс со статическими методами для подсчета площадей геометрических фигур: 
            //квадрата, прямоугольника, треугольника.Подключите dll-модуль к другому проекту и проверьте работу методов.


            //Console.WriteLine($"Square: {Areas2.GeometricAreas.SquareArea(4)}");
            //Console.WriteLine($"Triangle: {Areas2.GeometricAreas.RectangleArea(4,4)}");
            //Console.WriteLine($"Rectangle: {Areas2.GeometricAreas.TriangleArea(4,4,4)}");


            // Создайте приложение по типу «Console App», которое позволяет считать все текст из выбранного пользователем файла. 
            // Выбор файл происходит посредство вызова диалога, испльзуя хук.
            // Полученный текст, отобразите в консоли. Если в тексте присутствуют цифры, отобразите их общее количество.


        }
    }
}
